# Hello world

Basic pandas hacking based on [10 minutes to pandas](http://pandas.pydata.org/pandas-docs/version/0.24/getting_started/10min.html) docs article

## Imports
Pandas works on the top of numpy - and can also work with numpy so it is useful to import also numpy

In [2]:
import numpy as np
import pandas as pd

## Data series
DataSeries in 1d data structure (list of scalars)

In [14]:
s = pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

Date range (6 days) as a Series

In [16]:
s_date_range = pd.date_range('20180328', periods=6)
s_date_range

DatetimeIndex(['2018-03-28', '2018-03-29', '2018-03-30', '2018-03-31',
               '2018-04-01', '2018-04-02'],
              dtype='datetime64[ns]', freq='D')

## Data Frame
DataFrame is 2d data structure (list of data series)

In [6]:
df = pd.DataFrame(np.random.rand(5,5))
df

          0         1         2         3         4
0  0.822142  0.270336  0.370670  0.040118  0.999820
1  0.428845  0.371200  0.800757  0.637880  0.072055
2  0.744273  0.339956  0.578677  0.227646  0.501793
3  0.647664  0.107419  0.212971  0.377062  0.753753
4  0.899527  0.895684  0.173270  0.193073  0.279822

## Column headers
Headers can be added to DataFrame by using `columns` parameter or by passing a map instead of list during creation of DataFrame

using `coulumns` parameter

In [11]:
df_with_headers = pd.DataFrame(
    np.random.rand(5,5), 
    columns = ['First', 'Second', 'Third', 'Fourth', 'Fifth']
)

df_with_headers

      First    Second     Third    Fourth     Fifth
0  0.648354  0.052626  0.396685  0.485784  0.288131
1  0.293564  0.187894  0.242894  0.986952  0.422653
2  0.745987  0.530652  0.669310  0.983914  0.879547
3  0.927356  0.885106  0.617084  0.847775  0.973726
4  0.838347  0.207418  0.575903  0.445401  0.310979

Passing map:

In [19]:
df_with_headers_2 = pd.DataFrame({
    'First Column': np.random.rand(5),
    'Second Column': np.random.rand(5)
})

df_with_headers_2

   First Column  Second Column
0      0.550343       0.169001
1      0.932939       0.579405
2      0.866215       0.815361
3      0.404385       0.428840
4      0.027392       0.450566

## Index

Data Frame with custom index (rows "header")

In [13]:
df_with_renamed_index = pd.DataFrame(
    np.random.rand(5,5),
    index = ['row1', 'row2', 'row3', 'row4', 'row5']
)
df_with_renamed_index

             0         1         2         3         4
row1  0.312212  0.853058  0.567935  0.970198  0.193570
row2  0.738694  0.627618  0.703396  0.923895  0.955156
row3  0.532466  0.612704  0.456122  0.312747  0.540662
row4  0.157876  0.703971  0.796792  0.058286  0.127028
row5  0.494739  0.539993  0.789767  0.532538  0.040336

## Inspecting data frames

Checking `dtype` of columns (`dtype` is numpy class containing information about type of data)

In [37]:
df_to_inspect = pd.DataFrame(
    np.random.rand(4,4),
    columns = ['1st', '2nd', '3rd', '4th']
)
df_to_inspect
df_to_inspect.dtypes

1st    float64
2nd    float64
3rd    float64
4th    float64
dtype: object

Seeing information about index

In [36]:
df_to_inspect.index

RangeIndex(start=0, stop=4, step=1)

Seeing first n results

In [39]:
df_to_inspect.head(3)

        1st       2nd       3rd       4th
0  0.141024  0.035134  0.615337  0.558113
1  0.509351  0.419995  0.296363  0.443395
2  0.092250  0.779735  0.908150  0.342277

Seeing last n results

In [35]:
df_to_inspect.tail(3)

          E         Q         1       100
1  0.311009  0.303021  0.968629  0.440997
2  0.853866  0.460277  0.637535  0.780999
3  0.604892  0.362304  0.441190  0.835696

Convert data to numpy array

In [41]:
df_to_inspect.to_numpy()

array([[0.14102439, 0.03513414, 0.61533671, 0.55811252],
       [0.50935122, 0.41999477, 0.29636336, 0.44339456],
       [0.09224994, 0.77973475, 0.90815041, 0.34227672],
       [0.49825608, 0.85183988, 0.35587022, 0.63263593]])

Quick, basic statistic analysis of columns

In [43]:
df_to_inspect.describe()

            1st       2nd       3rd       4th
count  4.000000  4.000000  4.000000  4.000000
mean   0.310220  0.521676  0.543930  0.494105
std    0.224462  0.375351  0.279530  0.127686
min    0.092250  0.035134  0.296363  0.342277
25%    0.128831  0.323780  0.340994  0.418115
50%    0.319640  0.599865  0.485603  0.500754
75%    0.501030  0.797761  0.688540  0.576743
max    0.509351  0.851840  0.908150  0.632636

# DataFrame operations

Transposing

In [44]:
df = pd.DataFrame(
    np.random.rand(6,6),
    columns = ['One', 'Two', 'Three', 'Four', 'Five', 'Six']
)
df.T

              0         1         2         3         4         5
One    0.789709  0.049307  0.011412  0.211280  0.812702  0.709699
Two    0.488744  0.908303  0.038811  0.616597  0.198211  0.865469
Three  0.099317  0.811088  0.439719  0.899326  0.481717  0.983812
Four   0.677595  0.334719  0.276260  0.260680  0.106416  0.850100
Five   0.262056  0.702133  0.703255  0.278863  0.177747  0.969060
Six    0.516380  0.411818  0.576239  0.764887  0.585748  0.023902

## Rearanging DataFrame

Sorting columns

In [45]:
df = pd.DataFrame(
    np.random.rand(6,6),
    columns = ['One', 'Two', 'Three', 'Four', 'Five', 'Six']
)
df

        One       Two     Three      Four      Five       Six
0  0.109728  0.507085  0.396778  0.792931  0.590558  0.665736
1  0.574026  0.962227  0.684598  0.993132  0.801656  0.731256
2  0.699443  0.607860  0.635743  0.737771  0.795491  0.881278
3  0.814979  0.799399  0.262612  0.269255  0.360243  0.766887
4  0.337390  0.714952  0.586377  0.209834  0.064964  0.459752
5  0.060987  0.884712  0.801132  0.130354  0.926401  0.074226

In [50]:
df.sort_index(axis=1, ascending=False)

        Two     Three       Six       One      Four      Five
0  0.507085  0.396778  0.665736  0.109728  0.792931  0.590558
1  0.962227  0.684598  0.731256  0.574026  0.993132  0.801656
2  0.607860  0.635743  0.881278  0.699443  0.737771  0.795491
3  0.799399  0.262612  0.766887  0.814979  0.269255  0.360243
4  0.714952  0.586377  0.459752  0.337390  0.209834  0.064964
5  0.884712  0.801132  0.074226  0.060987  0.130354  0.926401

Sorting by values in column

In [51]:
df.sort_values(by='Three')

        One       Two     Three      Four      Five       Six
3  0.814979  0.799399  0.262612  0.269255  0.360243  0.766887
0  0.109728  0.507085  0.396778  0.792931  0.590558  0.665736
4  0.337390  0.714952  0.586377  0.209834  0.064964  0.459752
2  0.699443  0.607860  0.635743  0.737771  0.795491  0.881278
1  0.574026  0.962227  0.684598  0.993132  0.801656  0.731256
5  0.060987  0.884712  0.801132  0.130354  0.926401  0.074226

# Selection of data
TBD